## Code Dump for the project

Valid code goes into other files, this is just an exploration and testing ground

### Data Context

In recent years, the credit card issuers in Taiwan faced the cash and credit card debt crisis and the delinquency is expected to peak in the third quarter of 2006 (Chou,2006). In order to increase market share, card-issuing banks in Taiwan over-issued cash and credit cards to unqualified applicants. At the same time, most cardholders, irrespective of their repayment ability, overused credit card for consumption and accumulated heavy credit and cashâ€“card debts. The crisis caused the blow to consumer finance confidence and it is a big challenge for both banks and cardholders
<br>
### Column Information
<br>
PAY_0: Repayment status in September, 2005 (-1=pay duly, 1=payment delay for one month, 2=payment delay for two months,8=payment delay for eight - months, 9=payment delay for nine months and above) <br>
PAY_2: Repayment status in August, 2005 (scale same as above) <br>
PAY_3: Repayment status in July, 2005 (scale same as above) <br>
PAY_4: Repayment status in June, 2005 (scale same as above) <br>
PAY_5: Repayment status in May, 2005 (scale same as above) <br> 
PAY_6: Repayment status in April, 2005 (scale same as above) <br>
BILL_AMT1: Amount of bill statement in September, 2005 (NT dollar) <br>
BILL_AMT2: Amount of bill statement in August, 2005 (NT dollar) <br>
BILL_AMT3: Amount of bill statement in July, 2005 (NT dollar) <br>
BILL_AMT4: Amount of bill statement in June, 2005 (NT dollar) <br>
BILL_AMT5: Amount of bill statement in May, 2005 (NT dollar) <br>
BILL_AMT6: Amount of bill statement in April, 2005 (NT dollar) <br>
PAY_AMT1: Amount of previous payment in September, 2005 (NT dollar) <br>
PAY_AMT2: Amount of previous payment in August, 2005 (NT dollar) <br>
PAY_AMT3: Amount of previous payment in July, 2005 (NT dollar) <br>
PAY_AMT4: Amount of previous payment in June, 2005 (NT dollar) <br>
PAY_AMT5: Amount of previous payment in May, 2005 (NT dollar) <br>
PAY_AMT6: Amount of previous payment in April, 2005 (NT dollar) <br>

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from tqdm import tqdm

In [18]:
# Preprocessing

credit_data = pd.read_csv('data/credit_default_data.csv')

col_pay_status = []
col_bill_status = []
col_prev_pay_amount = []

for index, row in credit_data.iterrows():
    pay_status = [row['PAY_0'], row['PAY_2'], row['PAY_3'], row['PAY_4'], row['PAY_5'], row['PAY_6']]
    bill_status = [row['BILL_AMT1'], row['BILL_AMT2'], row['BILL_AMT3'], row['BILL_AMT4'], row['BILL_AMT5'], row['BILL_AMT6']]
    prev_pay_amount = [row['PAY_AMT1'], row['PAY_AMT2'], row['PAY_AMT3'], row['PAY_AMT4'], row['PAY_AMT5'], row['PAY_AMT6']]

    pay_status.reverse()
    bill_status.reverse()
    prev_pay_amount.reverse()
    
    col_pay_status.append(pay_status)
    col_bill_status.append(bill_status)
    col_prev_pay_amount.append(prev_pay_amount)

cols_to_drop = ['PAY_0', 'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2', 'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1', 'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6']
credit_data['pay_status'] = col_pay_status
credit_data['amt_bill_statement'] = col_bill_status
credit_data['prev_pay_amount'] = col_prev_pay_amount
credit_data = credit_data.drop(cols_to_drop, axis=1)
credit_data.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,default,pay_status,amt_bill_statement,prev_pay_amount
0,1,20000,F,University,Married,24,Y,"[-2, -2, -1, -1, 2, 2]","[0, 0, 0, 689, 3102, 3913]","[0, 0, 0, 0, 689, 0]"
1,2,120000,F,University,Single,26,Y,"[2, 0, 0, 0, 2, -1]","[3261, 3455, 3272, 2682, 1725, 2682]","[2000, 0, 1000, 1000, 1000, 0]"
2,3,90000,F,University,Single,34,N,"[0, 0, 0, 0, 0, 0]","[15549, 14948, 14331, 13559, 14027, 29239]","[5000, 1000, 1000, 1000, 1500, 1518]"
3,4,50000,F,University,Married,37,N,"[0, 0, 0, 0, 0, 0]","[29547, 28959, 28314, 49291, 48233, 46990]","[1000, 1069, 1100, 1200, 2019, 2000]"
4,5,50000,M,University,Married,57,N,"[0, 0, 0, -1, 0, -1]","[19131, 19146, 20940, 35835, 5670, 8617]","[679, 689, 9000, 10000, 36681, 2000]"

In [19]:
credit_data.head(20)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,default,pay_status,amt_bill_statement,prev_pay_amount
0,1,20000,F,University,Married,24,Y,"[-2, -2, -1, -1, 2, 2]","[0, 0, 0, 689, 3102, 3913]","[0, 0, 0, 0, 689, 0]"
1,2,120000,F,University,Single,26,Y,"[2, 0, 0, 0, 2, -1]","[3261, 3455, 3272, 2682, 1725, 2682]","[2000, 0, 1000, 1000, 1000, 0]"
2,3,90000,F,University,Single,34,N,"[0, 0, 0, 0, 0, 0]","[15549, 14948, 14331, 13559, 14027, 29239]","[5000, 1000, 1000, 1000, 1500, 1518]"
3,4,50000,F,University,Married,37,N,"[0, 0, 0, 0, 0, 0]","[29547, 28959, 28314, 49291, 48233, 46990]","[1000, 1069, 1100, 1200, 2019, 2000]"
4,5,50000,M,University,Married,57,N,"[0, 0, 0, -1, 0, -1]","[19131, 19146, 20940, 35835, 5670, 8617]","[679, 689, 9000, 10000, 36681, 2000]"
5,6,50000,M,Graduate school,Single,37,N,"[0, 0, 0, 0, 0, 0]","[20024, 19619, 19394, 57608, 57069, 64400]","[800, 1000, 1000, 657, 1815, 2500]"
6,7,500000,M,Graduate school,Single,29,N,"[0, 0, 0, 0, 0, 0]","[473944, 483003, 542653, 445007, 412023, 367965]","[13770, 13750, 20239, 38000, 40000, 55000]"
7,8,100000,F,University,Single,23,N,"[-1, 0, 0, -1, -1, 0]","[567, -159, 221, 601, 380, 11876]","[1542, 1687, 581, 0, 601, 380]"
8,9,140000,F,High School,Married,28,N,"[0, 0, 0, 2, 0, 0]","[3719, 11793, 12211, 12108, 14096, 11285]","[1000, 1000, 1000, 432, 0, 3329]"
9,10,20000,M,High School,Single,35,N,"[-1, -1, -2, -2, -2, -2]","[13912, 13007, 0, 0, 0, 0]","[0, 1122, 13007, 0, 0, 0]"
10,11,200000,F,High School,Single,34,N,"[-1, 0, 0, 2, 0, 0]","[3731, 1828, 2513, 5535, 9787, 11073]","[66, 3738, 300, 50, 12, 2306]"
11,12,260000,F,Graduate school,Single,51,N,"[2, -1, -1, -1, -1, -1]","[13668, 22287, 8517, 9966, 21670, 12261]","[3640, 0, 22301, 8583, 9966, 21818]"
12,13,630000,F,University,Single,41,N,"[-1, -1, -1, -1, 0, -1]","[2870, 6500, 6500, 6500, 6500, 12137]","[0, 2870, 6500, 6500, 6500, 1000]"
13,14,70000,M,University,Single,30,Y,"[2, 0, 0, 2, 2, 1]","[36894, 36137, 66782, 65701, 67369, 65802]","[0, 1500, 3000, 3000, 0, 3200]"
14,15,250000,M,Graduate school,Single,29,N,"[0, 0, 0, 0, 0, 0]","[55512, 56875, 59696, 63561, 67060, 70887]","[3000, 3000, 3000, 3000, 3000, 3000]"
15,16,50000,F,High School,Other,23,N,"[0, 0, 0, 0, 2, 1]","[30211, 29531, 28771, 28116, 29173, 50614]","[1100, 1300, 1200, 1100, 1500, 0]"
16,17,20000,M,Graduate school,Single,24,Y,"[2, 2, 2, 2, 0, 0]","[19104, 17905, 18338, 17428, 18010, 15376]","[0, 1650, 0, 1500, 0, 3200]"
17,18,320000,M,Graduate school,Married,49,N,"[-1, -1, -1, 0, 0, 0]","[195599, 5856, 70074, 194663, 246536, 253286]","[50000, 195599, 20000, 75940, 10000, 10358]"
18,19,360000,F,Graduate school,Married,49,N,"[-2, -2, -2, -2, -2, 1]","[0, 0, 0, 0, 0, 0]","[0, 0, 0, 0, 0, 0]"
19,20,180000,F,Graduate school,Single,29,N,"[-2, -2, -2, -2, -2, 1]","[0, 0, 0, 0, 0, 0]","[0, 0, 0, 0, 0, 0]"